ENGLISH_UK = \
    [
        '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-',
        'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '/',
        'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ':', '\'',
        'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '?', '!',
        # Shift
        '#', '£', '€', '$', '%', '^', '&', '*', '(', ')', '_',
        'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '@',
        'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ';', '"',
        'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '+', '=',
        # Numeric
        '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-',
        '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_',
        '~', '`', '=', '\\', '+', '{', '}', '|', '[', ']', ' ',
        '<', '>', ';', ':', '"', '\'', ',', '.', '?', '/'
        # Accents (A)
        'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ā', 'ă', 'ą', 'ç',
        'ć', 'ċ', 'č', 'ð', 'ď', 'ǆ', 'ǳ', 'è', 'é', 'ê', 'ë',
        'ē', 'ę', 'ě', 'ğ', 'ġ', 'ģ', 'ħ', 'ì', 'í', 'î', 'ï',
        'ī', 'į', 'ı', 'ĳ', 'ķ', 'ĺ', 'ļ', 'ľ', 'ł',
        'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ', 'Ā', 'Ă', 'Ą', 'Ç',
        'Ć', 'Ċ', 'Č', 'Ð', 'Ď', 'ǅ', 'ǲ', 'È', 'É', 'Ê', 'Ë',
        'Ē', 'Ę', 'Ě', 'Ğ', 'Ġ', 'Ģ', 'Ħ', 'Ì', 'Í', 'Î', 'Ï',
        'Ī', 'Į', 'İ', 'Ĳ', 'Ķ', 'Ĺ', 'Ļ', 'Ľ', 'Ł',
        # Accents (N)
        'ñ', 'ń', 'ņ', 'ň', 'ò', 'ó', 'ô', 'õ', 'ö', 'ø', 'œ',
        'ő', 'ō', 'ŕ', 'ř', 'š', 'ß', 'ś', 'ş', 'þ', 'ť', 'ţ',
        'ù', 'ú', 'û', 'ü', 'ū', 'ů', 'ű', 'ų', 'ý', 'ÿ', 'ź',
        'ż', 'ž',
        'Ñ', 'Ń', 'Ņ', 'Ň', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ø', 'Œ',
        'Ő', 'Ō', 'Ŕ', 'Ř', 'Š', 'ẞ', 'Ś', 'Ş', 'Þ', 'Ť', 'Ţ',
        'Ù', 'Ú', 'Û', 'Ü', 'Ū', 'Ů', 'Ű', 'Ų', 'Ý', 'Ÿ', 'Ź',
        'Ż', 'Ž'
    ]

ENGLISH_UK_REMOVED_DUPES = []
[ENGLISH_UK_REMOVED_DUPES.append(char) for char in ENGLISH_UK if char not in ENGLISH_UK_REMOVED_DUPES]
ENGLISH_UK_VALID_FOR_NAME_ONLY = [char for char in ENGLISH_UK_REMOVED_DUPES
                                  if char != '%'
                                  and char != '@'
                                  and char != '\\'
                                  and char != 'ō'
                                  and char != 'Ō']
